### Import required dependencies

In [39]:
import pandas as pd
import os

## Deliverable 1: Collect the Data

To collect the data that you’ll need, complete the following steps:

1. Using the Pandas `read_csv` function and the `os` module, import the data from the `new_full_student_data.csv` file, and create a DataFrame called student_df. 

2. Use the head function to confirm that Pandas properly imported the data.

In [40]:
# Create the path and import the data
full_student_data = os.path.join('../Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [41]:
# Verify that the data was properly imported
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

## Deliverable 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
1. Check for and remove all rows with `NaN`, or missing, values in the student DataFrame. 

2. Check for and remove all duplicate rows in the student DataFrame.

3. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.

4. Check data types using the `dtypes` property.

5. Remove the "th" suffix from every value in the grade column using `str` and `replace`.

6. Change the grade colum to the `int` type and verify column types.

7. Use the head (and/or the tail) function to preview the DataFrame.

In [42]:
# Check for null values
student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [43]:
# Drop rows with null values and verify removal
student_df = student_df.dropna()
student_df.isnull().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [44]:
# Check for duplicated rows
student_df.duplicated().sum()

1836

In [45]:
# Drop duplicated rows and verify removal
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [46]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [47]:
# Examine the grade column to understand why it is not an int
student_df["grade"]

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [48]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade'] = student_df['grade'].str.replace("th","")
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [49]:
# Change the grade column to the int type and verify column types
student_df['grade'] = student_df['grade'].astype(int)
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int32

## Deliverable 3: Summarize the Data

Describe the data using summary statistics on the data as a whole and on individual columns.

1. Generate the summary statistics for each DataFrame by using the `describe` function.

2. Display the mean math score using the `mean` function. 

2. Store the minimum reading score as `min_reading_score`.

In [50]:
# Display summary statistics for the DataFrame
student_df.describe()

       student_id     grade  reading_score  math_score  school_budget
count    1.48e+04  14831.00       14831.00    14831.00       14831.00
mean     6.98e+07     10.36          72.36       64.68      893742.75
std      3.45e+07      1.10          15.22       15.84       53938.07
min      1.00e+07      9.00          10.50        3.70      817615.00
25%      3.98e+07      9.00          62.20       54.50      846745.00
50%      6.97e+07     10.00          73.80       65.30      893368.00
75%      9.93e+07     11.00          84.00       76.00      956438.00
max      1.30e+08     12.00         100.00      100.00      991918.00

In [51]:
# Display the mean math score using the mean function
student_df.loc[:, 'math_score'].mean()

64.67573326141189

In [52]:
# Store the minimum reading score as min_reading_score
min_reading_score = student_df.loc[:, "reading_score"].min()
min_reading_score

10.5

## Deliverable 4: Drill Down into the Data

Drill down to specific rows, columns, and subsets of the data.

To drill down into the data, complete the following steps:

1. Use `loc` to display the grade column.

2. Use `iloc` to display the first 3 rows and columns 3, 4, and 5.

3. Show the rows for grade nine using `loc`.

4. Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the `min_reading_score` found in Deliverable 3.

5. Find the reading scores for the school and grade from the output of step three using `loc` with multiple conditional statements.

6. Using conditional statements and `loc` or `iloc`, find the mean reading score for all students in grades 11 and 12 combined.

In [53]:
# Use loc to display the grade column
student_df.loc[:, 'grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int32

In [54]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
student_df.iloc[0:3, 2:5]

   grade           school_name  reading_score
0      9  Sullivan High School           59.0
1      9     Dixon High School           94.7
2      9    Wagner High School           89.0

In [55]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
student_df.loc[student_df["grade"] == 9].describe()

       student_id   grade  reading_score  math_score  school_budget
count    4.13e+03  4132.0        4132.00     4132.00        4132.00
mean     6.98e+07     9.0          69.24       66.59      898692.61
std      3.47e+07     0.0          15.28       16.66       54891.60
min      1.00e+07     9.0          17.90        5.30      817615.00
25%      3.95e+07     9.0          59.00       56.00      846745.00
50%      6.98e+07     9.0          70.05       67.80      893368.00
75%      9.94e+07     9.0          80.50       78.50      957299.00
max      1.30e+08     9.0          99.90      100.00      991918.00

In [56]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [57]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
student_df.loc[(student_df["school_name"] == "Dixon High School") &
                (student_df["grade"] == 10), ["school_name", "reading_score"]]

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [58]:
# Find the mean reading score for all students in grades 11 and 12 combined.
student_df.loc[(student_df["grade"] == 11) | (student_df["grade"] == 12), "reading_score"].mean()

74.90038089192188

## Deliverable 5: Make Comparisons Between District and Charter Schools

Compare district vs charter schools for budget, size, and scores.

Make comparisons within your data by completing the following steps:

1. Using the `groupby` and `mean` functions, look at the average reading and math scores per school type.

1. Using the `groupby` and `count` functions, find the total number of students at each school.

2. Using the `groupby` and `mean` functions, find the average budget per grade for each school type.

In [59]:
# Use groupby and mean to find the average reading and math scores for each school type.
avg_school_scores = student_df.groupby(by=["school_type","grade"]).mean()
pd.set_option('display.precision', 1)
avg_school_scores.loc[:, ["reading_score", "math_score"]]

                   reading_score  math_score
school_type grade
Charter     9               68.7        70.1
            10              69.6        66.4
            11              80.6        68.0
            12              70.5        60.2
Public      9               69.7        63.8
            10              73.2        63.8
            11              73.5        59.3
            12              73.3        63.6

In [60]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.
total_students = student_df.groupby(by=["school_name", "school_type"]).count()
total_students.sort_values("school_budget", ascending=False)

,,student_id,student_name,grade,reading_score,math_score,school_budget
school_name,school_type,,,,,,
Montgomery High School,Charter,2038,2038,2038,2038,2038,2038
Green High School,Charter,1961,1961,1961,1961,1961,1961
Dixon High School,Charter,1583,1583,1583,1583,1583,1583
Wagner High School,Public,1541,1541,1541,1541,1541,1541
Silva High School,Public,1109,1109,1109,1109,1109,1109
Woods High School,Public,1052,1052,1052,1052,1052,1052
Sullivan High School,Public,971,971,971,971,971,971
Turner High School,Public,846,846,846,846,846,846
Bowers High School,Public,803,803,803,803,803,803
Fisher High School,Public,798,798,798,798,798,798
Richard High School,Charter,551,551,551,551,551,551
Campos High School,Public,541,541,541,541,541,541
Odonnell High School,Public,459,459,459,459,459,459
Campbell High School,Charter,407,407,407,407,407,407
Chang High School,Charter,171,171,171,171,171,171

In [61]:
# Display the average budget for each school type by using the groupby and mean functions:
school_budget = student_df.groupby(by="school_type").mean()
pd.set_option('display.precision', 2)
school_budget.loc[:, "school_budget"]

school_type
Charter    872625.66
Public     911195.56
Name: school_budget, dtype: float64

# Deliverable 6: Summarize Your Findings
In the cell below, write a few sentences to describe any discoveries you made while performing your analysis along with any additional analysis you believe would be worthwhile.

Overall, Charter and Public schools seem to be fairly similar. Both started with fairly low average scores in reading and math. Charter schools had a higher increase in reading scores over time, with a decrease in math scores over time. Although Public schools were able to maintain relatively consistent math scores throughout all 4 grades, Charter schools saw a drop in average math scores over time.
Population density of schools was fairly scattered witht the exception being the most populated schools. The top 3 schools with the most students were all Charter schools. Meanwhile, the average School Budget was slightly higher for Public schools, which may have impacted the performance over time of the Charter schools; with less money per-student, it could be said that the resources to keep the students' quality of education over the course of four years was difficult. There are exceptions, however, as Campbell High School is a charter school with both the third highest budget and one of the lowest student populations. Even with much more money per-student, though, Campbell still only achieved average scores in both Math and Reading, as shown below.

In [75]:
school_name_and_budget = student_df.groupby(by=["school_name", "school_type"]).max()
school_name_and_budget.loc[:, "school_budget"].sort_values(ascending=False)

school_name             school_type
Silva High School       Public         991918
Sullivan High School    Public         961125
Campbell High School    Charter        960726
Odonnell High School    Public         959474
Campos High School      Public         957299
Turner High School      Public         956438
Woods High School       Public         912243
Montgomery High School  Charter        893368
Richard High School     Charter        889699
Dixon High School       Charter        870334
Bowers High School      Public         848324
Wagner High School      Public         846745
Chang High School       Charter        840132
Green High School       Charter        832670
Fisher High School      Public         817615
Name: school_budget, dtype: int64

In [66]:
total_students.sort_values("school_name")

,,student_id,student_name,grade,reading_score,math_score,school_budget
school_name,school_type,,,,,,
Bowers High School,Public,803,803,803,803,803,803
Campbell High School,Charter,407,407,407,407,407,407
Campos High School,Public,541,541,541,541,541,541
Chang High School,Charter,171,171,171,171,171,171
Dixon High School,Charter,1583,1583,1583,1583,1583,1583
Fisher High School,Public,798,798,798,798,798,798
Green High School,Charter,1961,1961,1961,1961,1961,1961
Montgomery High School,Charter,2038,2038,2038,2038,2038,2038
Odonnell High School,Public,459,459,459,459,459,459
Richard High School,Charter,551,551,551,551,551,551
Silva High School,Public,1109,1109,1109,1109,1109,1109
Sullivan High School,Public,971,971,971,971,971,971
Turner High School,Public,846,846,846,846,846,846
Wagner High School,Public,1541,1541,1541,1541,1541,1541
Woods High School,Public,1052,1052,1052,1052,1052,1052

In [72]:
student_df.loc[student_df["school_name"] == "Campbell High School", "math_score"].mean()

62.179115479115445

In [73]:
student_df.loc[student_df["school_name"] == "Campbell High School", "reading_score"].mean()

71.1422604422605